In [2]:
import pandas as pd
df = pd.read_csv('QueryResults.csv', names=['DATE', 'TAG', 'POSTS'], header=0)

In [3]:
# view first 5 rows
df.head()

                  DATE         TAG  POSTS
0  2008-07-01 00:00:00          c#      3
1  2008-08-01 00:00:00    assembly      8
2  2008-08-01 00:00:00  javascript    162
3  2008-08-01 00:00:00           c     85
4  2008-08-01 00:00:00      python    124

In [4]:
# view first 5 rows
df.tail()

                     DATE    TAG  POSTS
1986  2020-07-01 00:00:00      r   5694
1987  2020-07-01 00:00:00     go    743
1988  2020-07-01 00:00:00   ruby    775
1989  2020-07-01 00:00:00   perl    182
1990  2020-07-01 00:00:00  swift   3607

In [5]:
# get the rows and column numbers
df.shape

(1991, 3)

In [6]:
# count the number of entries in each column
# number of non NaN values
df.count()

DATE     1991
TAG      1991
POSTS    1991
dtype: int64

In [8]:
# Which programming language had the most number of posts since the creation of Stack Overflow
df.groupby('TAG').sum()

              POSTS
TAG
assembly      34852
c            336042
c#          1423530
c++          684210
delphi        46212
go            47499
java        1696403
javascript  2056510
perl          65286
php         1361988
python      1496210
r            356799
ruby         214582
swift        273055

In [9]:
# Can you count how many months of posts exist for each programming language
df.groupby('TAG').count()

            DATE  POSTS
TAG
assembly     144    144
c            144    144
c#           145    145
c++          144    144
delphi       144    144
go           129    129
java         144    144
javascript   144    144
perl         144    144
php          144    144
python       144    144
r            142    142
ruby         144    144
swift        135    135

In [12]:
# Lets take a look at 'DATE' column in our DataFrame, second entry in the column
df['DATE'][1]

'2008-08-01 00:00:00'

In [13]:
# inspecting the type of data
type(df['DATE'][1])

str

In [14]:
# convert the entry to datetime in our cell
print(pd.to_datetime(df['DATE'][1]))
type(pd.to_datetime(df['DATE'][1]))

2008-08-01 00:00:00

pandas._libs.tslibs.timestamps.Timestamp

In [15]:
# Let's use Pandas' to_datetime() to convert the entire df['DATE'] column
df['DATE'] = pd.to_datetime(df['DATE'])
df.head()

        DATE         TAG  POSTS
0 2008-07-01          c#      3
1 2008-08-01    assembly      8
2 2008-08-01  javascript    162
3 2008-08-01           c     85
4 2008-08-01      python    124